app/views/users/show.html.erb

SELECT "tests".* FROM "tests" WHERE "tests"."user_id" = $1  [["user_id", 1]]
---
  <strong>Tests:</strong>
  <% @user.tests.each do |test| %>