app/controllers/tests_controller.rb

    def create
        @test = Test.new(test_params)
        if @test.save
---
INSERT INTO "tests" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "aaa"], ["created_at", "2023-09-02 04:34:05.118816"], ["updated_at", "2023-09-02 04:34:05.118816"], ["user_id", 6]]

    def update
        if not @test.update(test_params)
---
UPDATE "tests" SET "content" = $1, "updated_at" = $2 WHERE "tests"."id" = $3  [["content", "vvvv"], ["updated_at", "2023-09-02 04:35:41.090800"], ["id", 8]]

    def destroy
      @test.destroy
---
DELETE FROM "tests" WHERE "tests"."id" = $1  [["id", 6]]

    def set_test
        @test = Test.find(params[:id])
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]