app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "mamamama"], ["created_at", "2023-08-27 13:59:54.547657"], ["updated_at", "2023-08-27 13:59:54.547657"]]
---
  def create
    @user = User.new(user_params)
    if @user.save